[
    {
        "id": 1,
        "title": "The Grand Canyon Adventure",
        "location": "Grand Canyon, Arizona, USA",
        "latitude": 36.1069,
        "longitude": -112.1129,
        "content": "Standing at the edge of the Grand Canyon, I was overwhelmed by the sheer magnitude of nature's artistry. The layers of red and orange rock told stories millions of years old. As the sun set, the canyon transformed into a sea of gold and crimson, a sight that will forever be etched in my memory.",
        "tags": ["adventure", "nature", "USA"],
        "author": "John Smith",
        "date": "2026-01-15"
    },
    {
        "id": 2,
        "title": "Tokyo's Hidden Temple",
        "location": "Sensō-ji, Tokyo, Japan",
        "latitude": 35.7148,
        "longitude": 139.7967,
        "content": "In the heart of bustling Tokyo, I discovered Sensō-ji temple. The scent of incense filled the air as monks chanted in the distance. Among the crowds of tourists, I found a quiet corner where I could feel the centuries of devotion that had shaped this sacred place.",
        "tags": ["culture", "history", "Japan"],
        "author": "Emily Chen",
        "date": "2026-01-10"
    },
    {
        "id": 3,
        "title": "Santorini Sunset",
        "location": "Oia, Santorini, Greece",
        "latitude": 36.4618,
        "longitude": 25.3753,
        "content": "The white-washed buildings of Oia clung to the cliffs like snow on a mountain. As evening approached, the entire village gathered to watch the sunset. The sky exploded in shades of pink and purple, reflecting off the blue domes of the churches. It was a moment of pure magic.",
        "tags": ["travel", "sunset", "Greece"],
        "author": "Maria Rodriguez",
        "date": "2026-01-05"
    },
    {
        "id": 4,
        "title": "Machu Picchu at Dawn",
        "location": "Machu Picchu, Peru",
        "latitude": -13.1631,
        "longitude": -72.5450,
        "content": "We started our hike at 4 AM to reach the Sun Gate before sunrise. As the first rays of light broke through the mist, the ancient city of Machu Picchu revealed itself stone by stone. The Incas chose this location for good reason - it's truly a place where earth meets sky.",
        "tags": ["history", "hiking", "Peru", "adventure"],
        "author": "Carlos Mendez",
        "date": "2026-01-12"
    },
    {
        "id": 5,
        "title": "Northern Lights in Iceland",
        "location": "Reykjavik, Iceland",
        "latitude": 64.1466,
        "longitude": -21.9426,
        "content": "After three cloudy nights, we had almost given up hope. But on our last evening, the sky cleared and the aurora borealis danced above us in waves of green and purple. No photograph could capture the feeling of standing beneath nature's greatest light show.",
        "tags": ["nature", "aurora", "Iceland", "winter"],
        "author": "Anna Johansson",
        "date": "2026-01-08"
    }
]
